wlogs/auction3/workloadcz/singapore.txt
[OVERALL], RunTime(ms), 273940
[OVERALL], Throughput(ops/sec), 3.6504344016938015
[TOTAL_GCS_PS_Scavenge], Count, 5
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 30
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.010951303205081406
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 5
[TOTAL_GC_TIME], Time(ms), 30
[TOTAL_GC_TIME_%], Time(%), 0.010951303205081406
[UPDATE-FAILED], Operations, 76
[UPDATE-FAILED], AverageLatency(us), 196018.52631578947
[UPDATE-FAILED], MinLatency(us), 125632
[UPDATE-FAILED], MaxLatency(us), 665599
[UPDATE-FAILED], 50thPercentileLatency(us), 181759
[UPDATE-FAILED], 90thPercentileLatency(us), 239743
[UPDATE-FAILED], 95thPercentileLatency(us), 286719
[UPDATE-FAILED], 99thPercentileLatency(us), 404479
[DELETE], Operations, 318
[DELETE], AverageLatency(us), 466512.30188679247
[DELETE], MinLatency(us), 221824
[DELETE], MaxLatency(us), 1425407
[DELETE], 50thPercentileLatency(us), 446719
[DELETE], 90thPercentileLatency(us), 621567
[DELETE], 95thPercentileLatency(us), 681471
[DELETE], 99thPercentileLatency(us), 778239
[DELETE], Return=OK, 318
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 3.0
[CLEANUP], MinLatency(us), 3
[CLEANUP], MaxLatency(us), 3
[CLEANUP], 50thPercentileLatency(us), 3
[CLEANUP], 90thPercentileLatency(us), 3
[CLEANUP], 95thPercentileLatency(us), 3
[CLEANUP], 99thPercentileLatency(us), 3
[UPDATE], Operations, 253
[UPDATE], AverageLatency(us), 179256.41106719367
[UPDATE], MinLatency(us), 117568
[UPDATE], MaxLatency(us), 519935
[UPDATE], 50thPercentileLatency(us), 172159
[UPDATE], 90thPercentileLatency(us), 224639
[UPDATE], 95thPercentileLatency(us), 240511
[UPDATE], 99thPercentileLatency(us), 357631
[UPDATE], Return=OK, 253
[UPDATE], Return=ERROR, 76
[INSERT], Operations, 275
[INSERT], AverageLatency(us), 176817.10545454547
[INSERT], MinLatency(us), 113856
[INSERT], MaxLatency(us), 293887
[INSERT], 50thPercentileLatency(us), 175487
[INSERT], 90thPercentileLatency(us), 216703
[INSERT], 95thPercentileLatency(us), 230783
[INSERT], 99thPercentileLatency(us), 246655
[INSERT], Return=OK, 275
[INSERT], Return=ERROR, 78
[INSERT-FAILED], Operations, 78
[INSERT-FAILED], AverageLatency(us), 200456.61538461538
[INSERT-FAILED], MinLatency(us), 121280
[INSERT-FAILED], MaxLatency(us), 1150975
[INSERT-FAILED], 50thPercentileLatency(us), 191487
[INSERT-FAILED], 90thPercentileLatency(us), 229759
[INSERT-FAILED], 95thPercentileLatency(us), 239871
[INSERT-FAILED], 99thPercentileLatency(us), 249343